[
  {
    "title": "(Implementation) Project Manager",
    "companyLink": "https://weworkremotely.com/company/paymentology",
    "applyLink": "https://weworkremotely.com/listings/paymentology-implementation-project-manager-2",
    "company": "Paymentology",
    "location": "London",
    "jobType": "Featured",
    "description": "We’re looking for an Implementations Project Manager to drive end-to-end delivery of client implementations, ensuring seamless coordination between internal teams and external stakeholders. This role is critical in ensuring successful project delivery through strong project management, proactive communication, and detailed execution.\n\nIf you thrive in high-impact environments and are passionate about delivering exceptional client experiences, this could be your next opportunity.\n\n \n\nWhat you get to do:\n\nProject Leadership & Coordination\n\nOrganise and lead internal handover meetings to ensure a smooth transition from Sales to Implementation.\nFacilitate client project kick-offs to align on objectives, timelines, and expectations.\nOversee end-to-end project execution and delivery, ensuring clear milestones and deliverables.\n\nCommunication & Stakeholder Management\n\nCoordinate discussions with third-party vendors to align project scope and ensure contractual obligations are met.\nMaintain strong lines of communication with infrastructure and technical teams to ensure alignment.\nManage daily communication channels with clients, providing updates and resolving queries.\n\nDocumentation & Risk Management\n\nVerify implementation documentation, including Product Specification Forms, for accuracy and completeness.\nMonitor, track, and follow up on tasks that impact project delivery.\nProactively identify and escalate risks or potential delays to mitigate impact.\n\nCross-Functional Support\n\nCollaborate with Technical Implementation Managers and other teams to ensure smooth execution of implementation activities.\nAssist with internal coordination and external client interaction where required.\n\n \n\nWhat it takes to succeed:\n\nProficiency with project management tools such as Microsoft Project, Jira, or Asana.\nStrong understanding of the card issuing and payment processing environment.\nProven ability to manage complex implementations and balance multiple priorities.\nExceptional communication and stakeholder engagement skills.\nAbility to adapt quickly in a fast-paced, cross-functional environment.\nStrong problem-solving skills and a proactive mindset.\nFluency in English (written and verbal).\n\n \n\nEducation & Experience:\n\nBachelor’s degree in Business, Engineering, or a related field.\nProject Management certification is a plus.\n3 - 5 years of experience in project management, ideally in implementations or a similar client-facing role within fintech or payments.\nStrong familiarity with software delivery and infrastructure alignment.\nKnowledge of cards and the payment industry is preferred.\n\n \n\nWhat you can look forward to: \n\nAt Paymentology, it’s not just about building great payment technology, it’s about building a company where people feel they belong and their work matters. You’ll be part of a diverse, global team that’s genuinely committed to making a positive impact through what we do. Whether you’re working across time zones or getting involved in initiatives that support local communities, you’ll find real purpose in your work – and the freedom to grow in a supportive, forward-thinking environment.\n\nApply Now\n\nLet's start your dream job\n\nApply now\nMeet JobCopilot: Your Personal AI Job Hunter\n\nAutomatically Apply to Remote All Other Remote Jobs\n\nJust set your preferences and Job Copilot will do the rest-finding, filtering, and applying while you focus on what matters.\n\nActivate JobCopilot"
  },
  {
    "title": "Procurement Analyst",
    "companyLink": "https://weworkremotely.com/company/paymentology",
    "applyLink": "https://weworkremotely.com/listings/paymentology-procurement-analyst",
    "company": "Paymentology",
    "location": "London",
    "jobType": "Featured",
    "description": "The Procurement Analyst is responsible for supporting procurement and finance teams in negotiating contracts and enhancing Paymentology’s purchasing processes. This role plays a key part in improving Paymentology’s commercial position and financial performance by identifying cost-saving opportunities, ensuring compliance with internal and external procurement policies, and implementing structured purchasing procedures.\n\nContract Negotiation and Procurement Management:\n\nAssist in the negotiation of new contracts and contract renewals, ensuring optimal commercial terms for Paymentology.\nIdentify cost-saving opportunities by analysing procurement data and monitoring expenditure.\nMaintain accurate and up-to-date records of supplier agreements, procurement activities, and savings opportunities.\n\nFinancial and Data Analysis:\n\nMonitor and analyse procurement data to track expenditure trends and highlight efficiency opportunities.\nDevelop dashboards to visualise spend, assess supplier performance, and identify key cost-reduction strategies.\n\nCompliance and Vendor Onboarding:\n\nWork closely with legal, compliance, and cybersecurity teams to onboard vendors in accordance with Paymentology’s internal policies, PCI regulations, and client requirements.\nEnsure that all procurement processes align with regulatory standards and risk management protocols.\n\nCross-Functional Collaboration:\n\nCollaborate with internal stakeholders to proactively manage purchases and secure the best commercial deals.\nSupport the rollout and continuous improvement of procurement processes, including the implementation of a third-party risk management system and purchase order process within the current ERP system.\nOutcome: A structured, data-driven procurement process that enhances financial performance, mitigates risk, and ensures Paymentology secures the best value in supplier agreements.\n\nWhat it takes to succeed:\n\nStrong analytical skills with the ability to interpret and compare complex, multi-layered commercial proposals.\nExcellent interpersonal skills, with the ability to engage and influence internal and external stakeholders.\nProficiency in Microsoft Office, particularly Excel, for procurement data analysis and reporting.\nHigh attention to detail, with the ability to manage multiple concurrent tasks in a fast-paced environment.\nExperience in technology procurement, particularly in SaaS-based agreements.\nUnderstanding of legal contract review and negotiation.\nFamiliarity with ERP systems is preferred.\n\nYears of Experience\n\n2–3 years of experience in a procurement or commercial-based role.\nProven track record of contract negotiation, supplier management, and cost-saving initiatives.\nExperience in technology and SaaS procurement is highly desirable.\nApply Now\n\nLet's start your dream job\n\nApply now\nMeet JobCopilot: Your Personal AI Job Hunter\n\nAutomatically Apply to Remote All Other Remote Jobs\n\nJust set your preferences and Job Copilot will do the rest-finding, filtering, and applying while you focus on what matters.\n\nActivate JobCopilot"
  },
  {
    "title": "Languages teachers",
    "companyLink": "https://weworkremotely.com/company/ae-virtual-class-s-a",
    "applyLink": "https://weworkremotely.com/listings/ae-virtual-class-s-a-languages-teachers",
    "company": "AE Virtual Class S.A",
    "location": "Panama",
    "jobType": "Featured",
    "description": "Description:\n\n\nAE Virtual Class, member of Academia Europea Group, leader in language teaching, with 56 years of experience and the largest teaching staff in the Americas! We are looking for language enthusiasts who want to be part of our great family! Experience is NOT a requirement! We teach you how to teach!\n\n\nJob Requirements:\n\n\nLaptop (with webcam).\nStable internet connection (15 Mbps).\nAttitude.\nDynamism.\nAfternoon and/or evening shifts (Central America time zone).\nExcellent Mandarin, German, Italian or French proficiency (C1-C2).\n\n\nMain responsibilities of the position:\n\n\nMotivate students.\nGenerate interest in cultures and languages.\nPrepare reports.\nEvaluations.\nApply Now\n\nLet's start your dream job\n\nApply now\nMeet JobCopilot: Your Personal AI Job Hunter\n\nAutomatically Apply to Remote All Other Remote Jobs\n\nJust set your preferences and Job Copilot will do the rest-finding, filtering, and applying while you focus on what matters.\n\nActivate JobCopilot"
  }
]